# Data Analysis with Pandas

By Liliana Torres
&nbsp;

## What is Pandas and what do we use it for?

![](images/QuotePandas.jpg)

### Exploring the Data 
We will be working with a business that offer pet services. We have certain questions from busines that we would like to answer..

 * people_person : this file has details of each user on the site. it might contain pet owners, pet sitters or people that has not done any transactions on the site
 * pets_pet : this file contains each pet that a user has added to their profile. One owner might have more than one pet, but not viceversa.
 * services_service: on the site users might offer pet care services. This file has stored each record of that service that is offered. Each user can have more than one service but not one of each type.
 * conversations_conversation : An owner can book a service provider by starting a conversation with them. This will store each conversation started on the platform.
 * conversations_conversation_pets : Since a booking my involve many pets and many pets might had many bookings, it is neccesary to store this many to many relationship.
 * conversations_message : Each conversation consists of a series of messages. A conversation may contain many messages, but not viceversa: 
 * conversations_review : if a booking ocurrs, then either participant can leave a review for the experience. This file has records of those reviews, which consists of a brief statement and a star rating.

###   * Loading the data into a dataframes

In [5]:
# importing the libraries
import pandas as pd
import numpy as np

In [7]:
#Read the CSV data
people_person = pd.read_csv ('../DataAnalysisPandas/datasets/people_person.csv')
pets_pet = pd.read_csv ('../DataAnalysisPandas/datasets/pets_pet.csv')
services_service = pd.read_csv ('../DataAnalysisPandas/datasets/services_service.csv')
conversations_conversation = pd.read_csv ('../DataAnalysisPandas/datasets/conversations_conversation.csv')
conversations_conversation_pets = pd.read_csv ('../DataAnalysisPandas/datasets/conversations_conversation_pets.csv')
conversations_message = pd.read_csv ('../DataAnalysisPandas/datasets/conversations_message.csv')
conversations_review = pd.read_csv ('../DataAnalysisPandas/datasets/conversations_review.csv')

### * We will begin answering some questions to the business to get to know more the data

1) How many users have signed up ?

In [8]:
# lets take a look of the people person  data
people_person.head()

,id,first_name,last_name,email,channel,date_joined,photo,fee,gender
0,1,Leanora,Allcock,leanora.allcock635@hotmail.com,NaN,2016-08-02 14:59:15.095591,https://placekitten.com/242/269,0.0,f
1,2,Elroy,Blanding,elroy.blanding510@yahoo.com,NaN,2016-08-02 18:15:30.105940,https://placekitten.com/373/320,0.0,m
2,3,Jeanice,Aleman,jeanice.aleman392@hotmail.com,NaN,2016-08-02 16:11:09.542004,https://placekitten.com/238/264,0.0,f
3,4,Tamala,Polhamus,tamala.polhamus146@aol.com,NaN,2016-08-02 18:02:40.389299,https://placekitten.com/220/223,0.0,f
4,5,Alethea,Gubler,alethea.gubler708@aol.com,NaN,2016-08-02 14:31:53.163034,https://placekitten.com/284/339,0.0,f

In [34]:
count_users = people_person.id.count()
count_users

64393

In [21]:
# you can also count the users for one level multindex
count_users1 = people_person.set_index(["id", "gender"]).count(level = "gender")
count_users1

        first_name  last_name  email  channel  date_joined  photo    fee
gender
f            32075      32075  32075    25781        32075  32075  32075
m            32318      32318  32318    25874        32318  32318  32318

2) How many users signed up prior to 2018-02-03 ?

In [35]:
users_prior = people_person [(people_person['date_joined'] < '2018-02-03')].id.count()
users_prior
# another way
#total_date_joined = users_prior[['id']]
#total_date_joined

35826

 3) What percentaje of users have added pets ?
 To find how many users have added pets we will need to use more than one file, because one file  has the customers and one file has the pets.
 When we join a data set by the keys we will need to set that key as index

Lets take a look at the data in the two csv

In [39]:
pets_pet.head()

,id,name,description,gender,weight,birthday,plays_cats,plays_children,plays_dogs,spayed_neutered,house_trained,size,owner_id
0,1,Jammie,Morbi fames a mauris elit malesuada platea.,f,76,2016-05-26,1,1,1,1,1,large,12601
1,2,Lonnie,Class magna a libero felis sociosqu.,f,12,2014-05-20,0,1,1,1,0,small,12602
2,3,Emely,Felis class.,m,11,2014-08-21,0,1,1,1,0,small,12602
3,4,Emelia,Fames class egestas mollis risus posuere.,f,35,2013-09-23,1,1,1,0,0,medium,12603
4,5,Jami,Netus augue a congue orci.,m,35,2014-05-13,0,1,1,1,1,medium,12603

In [38]:
people_person.head()

,id,first_name,last_name,email,channel,date_joined,photo,fee,gender
0,1,Leanora,Allcock,leanora.allcock635@hotmail.com,NaN,2016-08-02 14:59:15.095591,https://placekitten.com/242/269,0.0,f
1,2,Elroy,Blanding,elroy.blanding510@yahoo.com,NaN,2016-08-02 18:15:30.105940,https://placekitten.com/373/320,0.0,m
2,3,Jeanice,Aleman,jeanice.aleman392@hotmail.com,NaN,2016-08-02 16:11:09.542004,https://placekitten.com/238/264,0.0,f
3,4,Tamala,Polhamus,tamala.polhamus146@aol.com,NaN,2016-08-02 18:02:40.389299,https://placekitten.com/220/223,0.0,f
4,5,Alethea,Gubler,alethea.gubler708@aol.com,NaN,2016-08-02 14:31:53.163034,https://placekitten.com/284/339,0.0,f

Note that the connection is the people_person id column with the pets_pet owner_id

In [122]:
# lets join those two dataframes
people_pets=pd.merge (pets_pet,people_person, how='left',left_on=['owner_id'], right_on=['id'], suffixes=('_left','_right'))
people_pets.head()

,id_left,name,description,gender_left,weight,birthday,plays_cats,plays_children,plays_dogs,spayed_neutered,...,owner_id,id_right,first_name,last_name,email,channel,date_joined,photo,fee,gender_right
0,1,Jammie,Morbi fames a mauris elit malesuada platea.,f,76,2016-05-26,1,1,1,1,...,12601,12601,Juliane,Vranicar,juliane.vranicar409@gmail.com,Google,2018-03-12 01:46:38.845836,https://placekitten.com/272/388,0.07,f
1,2,Lonnie,Class magna a libero felis sociosqu.,f,12,2014-05-20,0,1,1,1,...,12602,12602,Barton,Wilcoxon,barton.wilcoxon366@rover.com,Google,2017-12-11 20:59:13.074504,https://placekitten.com/355/244,0.07,m
2,3,Emely,Felis class.,m,11,2014-08-21,0,1,1,1,...,12602,12602,Barton,Wilcoxon,barton.wilcoxon366@rover.com,Google,2017-12-11 20:59:13.074504,https://placekitten.com/355/244,0.07,m
3,4,Emelia,Fames class egestas mollis risus posuere.,f,35,2013-09-23,1,1,1,0,...,12603,12603,Lupe,Taney,lupe.taney349@aol.com,WOM,2017-08-30 21:13:26.371762,https://placekitten.com/299/271,0.05,f
4,5,Jami,Netus augue a congue orci.,m,35,2014-05-13,0,1,1,1,...,12603,12603,Lupe,Taney,lupe.taney349@aol.com,WOM,2017-08-30 21:13:26.371762,https://placekitten.com/299/271,0.05,f

In [64]:
total_added_pet=pets_pet.owner_id.nunique()
total_added_pet

51793

In [63]:
total_users=people_person.id.nunique()
total_users

64393

In [65]:
pecentage_added = total_added_pet * 100 / total_users
pecentage_added

80.4326557234482

4)  Of those users, how many they have been added on average ?

In [67]:
# we will use need to use the total_user and calculate from those how many have been added 
total_added_pet_all = pets_pet.id.count()
total_added_pet_all

77730

In [68]:
added_average = total_added_pet_all /total_added_pet
added_average

1.500781958951982

5) What percentage of pets play well with cats?

In [95]:
total_plays_cats = (pets_pet.plays_cats.sum() * 100 ) / pets_pet.plays_cats.count()
total_plays_cats

24.850122217933873

6) How can we determine for bookings, if the owner is likely to leave a review?
We will need to probably break this down into more questions , like the overall y bookings and ratings

In [98]:
conversations_review.head()

,id,content,stars,conversation_id,reviewer_id
0,1,Netus proin per duis dolor venenatis nam.,1,7,64386
1,2,Dolor proin donec phasellus ve suspendisse ac ...,5,9,64384
2,3,Proin ipsum urna nisl egestas justo class a ar...,5,11,64382
3,4,Porta velit lectus varius donec tellus sollici...,1,13,64381
4,5,Dolor felis.,2,15,64379

In [74]:
conversations_conversation.head()

,id,start_date,end_date,units,added,booking_total,cancellation_fault,requester_id,service_id,booked_at,cancelled_at
0,1,2018-07-26,2018-07-31,5,2018-07-16 10:17:53.460035,120,NaN,64393,4646,NaN,NaN
1,2,2018-08-10,2018-08-16,6,2018-08-01 10:20:48.626868,132,NaN,64392,10126,NaN,NaN
2,3,2018-06-16,2018-06-19,3,2018-06-05 16:46:39.542467,168,NaN,64391,20677,NaN,NaN
3,4,2018-07-13,2018-07-20,7,2018-07-02 09:12:22.275923,490,NaN,64391,3847,NaN,NaN
4,5,2018-07-02,2018-07-07,5,2018-06-21 16:02:48.694725,140,NaN,64389,9982,NaN,NaN

In [75]:
people_person.head()

,id,first_name,last_name,email,channel,date_joined,photo,fee,gender
0,1,Leanora,Allcock,leanora.allcock635@hotmail.com,NaN,2016-08-02 14:59:15.095591,https://placekitten.com/242/269,0.0,f
1,2,Elroy,Blanding,elroy.blanding510@yahoo.com,NaN,2016-08-02 18:15:30.105940,https://placekitten.com/373/320,0.0,m
2,3,Jeanice,Aleman,jeanice.aleman392@hotmail.com,NaN,2016-08-02 16:11:09.542004,https://placekitten.com/238/264,0.0,f
3,4,Tamala,Polhamus,tamala.polhamus146@aol.com,NaN,2016-08-02 18:02:40.389299,https://placekitten.com/220/223,0.0,f
4,5,Alethea,Gubler,alethea.gubler708@aol.com,NaN,2016-08-02 14:31:53.163034,https://placekitten.com/284/339,0.0,f

In [116]:
pe_person = people_person [["id","date_joined", "gender"]]
#pe_person.head()
pe_person.set_index(["id"])

                      date_joined gender
id
1      2016-08-02 14:59:15.095591      f
2      2016-08-02 18:15:30.105940      m
3      2016-08-02 16:11:09.542004      f
4      2016-08-02 18:02:40.389299      f
5      2016-08-02 14:31:53.163034      f
...                           ...    ...
64389  2018-06-19 14:42:37.634474      m
64390  2018-07-29 06:42:31.039837      m
64391  2018-06-01 17:21:39.450001      f
64392  2018-07-30 03:18:03.550672      m
64393  2018-07-15 01:45:41.618416      f

[64393 rows x 2 columns]

In [115]:
conv_review = conversations_review[["reviewer_id", "stars"]]
conv_review.set_index(["reviewer_id"])
#conv_review.head()

             stars
reviewer_id
64386            1
64384            5
64382            5
64381            1
64379            2
...            ...
12608            4
12607            5
12606            1
12604            5
12603            5

[28561 rows x 1 columns]

In [121]:
con_con = conversations_conversation[["requester_id", "booked_at", "cancelled_at"]]
con_final = con_con.set_index(["requester_id"])
con_final.head()

             booked_at cancelled_at
requester_id
64393              NaN          NaN
64392              NaN          NaN
64391              NaN          NaN
64391              NaN          NaN
64389              NaN          NaN

In [182]:
mergedDf = conversations_conversation.merge(people_person, left_on='requester_id', right_on='id')
finalDf = mergedDf.merge(conversations_review, how="left",left_on='requester_id', right_on='reviewer_id')

In [131]:
#peocon_conrev= pd.merge(conversations_review[["reviewer_id", "stars"]], people_conversations,
                       # how='inner',left_on=['reviewer_id'], 
                        #right_on=['id'], suffixes=('_left','_right'))
#peocon_conrev.head()

,reviewer_id,stars,id,date_joined,gender,requester_id,booked_at,cancelled_at
0,64386,1,64386,2018-07-20 09:53:50.791735,m,64386,2018-07-22 02:50:20.676664,NaN
1,64384,5,64384,2018-06-19 09:03:29.715286,f,64384,2018-06-23 01:49:33.596667,NaN
2,64382,5,64382,2018-05-30 09:10:35.631308,m,64382,2018-06-07 01:24:20.187356,NaN
3,64382,5,64382,2018-05-30 09:10:35.631308,m,64382,NaN,NaN
4,64381,1,64381,2018-07-12 02:48:23.959257,f,64381,2018-07-19 01:01:11.552880,NaN

In [181]:
removes=finalDf[(pd.notnull(finalDf["booked_at"])) & (pd.isnull(finalDf["cancelled_at"]))]
removes.shape

(41001, 25)

In [174]:
filtered_df.shape

(37532, 8)

In [159]:
single_reviews=filtered_df2.reviewer_id.count()
single_reviews

1561

In [178]:
removes.groupby(['stars'])['reviewer_id'].count()

stars
1.0     2080
2.0     2097
3.0     2118
4.0     2108
5.0    27568
Name: reviewer_id, dtype: int64

In [155]:
conversations_review["stars"].mean()

4.307377192675326